examples/generating-vu-tokens/auth-with-token.yml
config:
  target: 'http://www.artillery.io'
  processor: ./helpers.js
  phases:
    - arrivalCount: 10
      duration: 1
before:
  flow:
    - function: generateSharedToken
scenarios:
  - flow:
      - function: generateVUToken
      - log: 'VU id: {{ $uuid }}'
      - log: '    shared token is: {{ sharedToken }}'
      - log: '    VU-specific token is: {{ vuToken }}'
      - get:
          url: /
          headers:
            x-auth-one: '{{ sharedToken }}'
            x-auth-two: '{{ vuToken }}'